Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་སྙིང་རྗེ་པད་མ་དཀར་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra The White Lotus of Compassion Turning the Wheel of the Dharma

source: བམ་པོ་དང་པོ།
en: Chapter 1

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas.

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན། བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ།
en: Thus did I hear at one time: the Bhagavat was residing at Rājagṛha, on Vulture Peak Mountain,

source: དགེ་སློང་དྲུག་ཁྲི་ཉིས་སྟོང་གི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ། ཟག་པ་ཟད་པ། ཉོན་མོངས་པ་མེད་པ། དབང་དང་ལྡན་པར་གྱུར་པ། སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཤེས་རབ་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཅང་ཤེས་པ། གླང་པོ་ཆེན་པོ་བྱ་བ་བྱས་པ། བྱེད་པ་བྱས་པ། ཁུར་བོར་བ། བདག་གི་དོན་རྗེས་སུ་ཐོབ་པ། སྲིད་པར་ཀུན་ཏུ་སྦྱོར་བ་ཡོངས་སུ་ཟད་པ། ཡང་དག་པའི་ཤེས་པས་སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། སེམས་ཀྱི་དབང་ཐམས་ཅད་ཀྱི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པ་ཤ་སྟག་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ་གང་ཟག་གཅིག་མ་གཏོགས་པ་ནི་འདི་ལྟ་སྟེ། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོའོ།
en: accompanied by a great saṅgha of 62,000 bhikṣus who, with the exception of one individual—which is to say, Venerable Ānanda—were all arhats whose outflows had ceased, who were without kleśas, who were self-controlled, who had liberated minds, who had completely liberated wisdom, who were noble beings, who were great elephants, who had done what had to be done, who had accomplished what had to be accomplished, who had put down their burden, who had reached their goals, who had ended the fetters to existence, who had liberated their minds through true knowledge, and who had attained all the perfect, highest, most complete powers of the mind.

source: །བྱམས་པ་ལ་སོགས་པ་གཟུངས་དང་། བཟོད་པ་དང་། ཏིང་ངེ་འཛིན་ཐོབ་པ། སྟོང་པ་ཉིད་ལ་གནས་པ། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་ཡ་ཕྲག་བརྒྱད་དང་ཡང་ཐབས་ཅིག་གོ།
en: Also present were eighty million irreversible bodhisattva mahāsattvas, such as Maitreya, who were established in retention, acceptance, samādhi, and emptiness.

source: །མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་། ཚངས་རིས་ཀྱི་ལྷའི་བུ་འབུམ་ཕྲག་མང་པོ་དང་ཡང་ཐབས་ཅིག་གོ། །ལྷའི་བུ་གཞན་འཕྲུལ་དང་།
en: Also present was Brahmā, the lord of Sahā, with many hundreds of thousands of Brahmā-realm devas.

source: གཞན་འཕྲུལ་གྱི་ལྷའི་བུ་ས་ཡ་ཕྲག་བརྒྱད་དང་ཡང་ཐབས་ཅིག་གོ། །ལྷའི་བུ་འཕྲུལ་དགའ་དང་།
en: Also present was Para­nirmitavaśavartin with eighty million Para­nirmitavaśavartin devas.

source: འཕྲུལ་དགའི་ལྷའི་བུ་ས་ཡ་ཕྲག་བདུན་དང་ཡང་ཐབས་ཅིག་གོ། །ལྷའི་བུ་ཡོངས་སུ་དགའ་ལྡན་དང་།
en: Also present was Sunirmita with seventy million Nirmāṇarata devas.

source: ཡོངས་སུ་དགའ་ལྡན་ལྷའི་བུ་ས་ཡ་ཕྲག་དྲུག་དང་ཡང་ཐབས་ཅིག་གོ། །ལྷའི་བུ་རབ་འཐབ་བྲལ་དང་།
en: Also present was Saṃtuṣita with sixty million Saṃtuṣita devas.

source: རབ་འཐབ་བྲལ་གྱི་ལྷའི་བུ་ས་ཡ་ཕྲག་བདུན་དང་། ཉི་འབུམ་དང་ཡང་ཐབས་ཅིག་གོ། །ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་།
en: Also present was Suyāma with 70,200,000 Yāma devas.

source: སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷའི་བུ་ས་ཡ་ཕྲག་བརྒྱད་དང་ཡང་ཐབས་ཅིག་གོ།
en: Also present was Śakra, lord of the devas, with eighty million Trāyastriṃśa devas.

source: །རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་གནོད་སྦྱིན་འབུམ་གྱིས་ཡོངས་སུ་བསྐོར་བ་དང་ཡང་ཐབས་ཅིག་གོ།
en: Also present was the mahārāja Vaiśravaṇa with a hundred thousand yakṣas.

source: །མིག་མི་བཟང་ཀླུ་འབུམ་གྱིས་ཡོངས་སུ་བསྐོར་བ་དང་ཡང་ཐབས་ཅིག་གོ།
en: Also present was the mahārāja Virūpākṣa with a hundred thousand nāgas.

source: །འཕགས་སྐྱེས་པོ་གྲུལ་བུམ་འབུམ་གྱིས་ཡོངས་སུ་བསྐོར་བ་དང་ཡང་ཐབས་ཅིག་གོ།
en: Also present was the mahārāja Virūḍhaka with a hundred thousand kumbhāṇḍas.

source: །ཡུལ་འཁོར་སྲུང་དྲི་ཟ་འབུམ་གྱིས་ཡོངས་སུ་བསྐོར་བ་དང་ཡང་ཐབས་ཅིག་གོ།
en: Also present was the mahārāja Dhṛtarāṣṭra with a hundred thousand gandharvas.

source: །ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་། ཉེ་དགའ་བོ་ཀླུའི་རྒྱལ་པོ་སྟོང་གིས་ཡོངས་སུ་བསྐོར་བ་དང་།
en: Also present were a thousand nāga kings, such as the nāga kings Nanda and Upananda.

source: དེ་དག་ལ་སོགས་པ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པ། ཕྱིན་ཅི་ལོག་བཞིའི་ཆོས་སྣང་ཞིང་གསལ་བར་རྟོགས་པར་ཁོང་དུ་ཆུད་པ་གང་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཏིང་ངེ་འཛིན་སྣ་ཚོགས་རབ་ཏུ་འཐོབ་པར་འགྱུར་བ་དང་།
en: They and others had all entered the Mahāyāna, practiced the six perfections, and perceived, understood, and comprehended the Dharma of the four misapprehensions.

source: གང་གིས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱིས་ལས་ཡང་དག་པར་འདའ་བར་འགྱུར་བ་དང་། ཏིང་ངེ་འཛིན་གང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་འགྱུར་བའི་འཕགས་པའི་བདེན་པ་བཞི་ཡང་དག་པར་རབ་ཏུ་རྟོགས་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་པ་ཤ་སྟག་གིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་ཏེ་བཞུགས་སོ། །དེའི་ཚེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་མཐོང་བ་དོན་ཡོད་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཆུ་ལྷ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེང་གེའི་བློ་གྲོས་དང་།
en: They were all gathered around and they looked upon the one before them who teaches the Dharma in order that the four noble truths will be realized, and so that bodhisattva mahāsattvas will attain the various samādhis, the level of the śrāvakas and pratyekabuddhas will be transcended, and through samādhi the highest, most complete enlightenment will be attained.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་སྣང་བྱེད་བློ་གྲོས་དང་། དེ་དག་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་ཁྲི་ལྷན་ཅིག་ཏུ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་ཤར་ལྷོའི་ཕྱོགས་ལོགས་སུ་མངོན་པར་ཕྱོགས་ཏེ་རབ་ཏུ་དགའ་ཞིང་རབ་ཏུ་དང་བའི་ཡིད་ཀྱིས་བལྟས་ནས་ཚིག་འདི་སྐད་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མ་དམ་པ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་རིང་པོ་མ་ལོན་པར་ཆོ་འཕྲུལ་ཆེན་པོ་དག་བསྟན་ནས། སེམས་ཅན་རྣམས་ལས་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་གི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་སྨིན་པར་མཛད་ཅིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ལ་བཀོད་པ་ནི་ངོ་མཚར་ཏེ་ཕྱག་འཚལ་ལོ་ཕྱག་འཚལ་ལོ་ཞེས་ཀྱང་སྨྲས་སོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེ་རྣམ་པར་སྣང་བྱེད་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: At that time, the bodhisattva mahāsattva Maitreya, the bodhisattva Amoghadarśin, the bodhisattva Varuṇa, the bodhisattva Siṃhamati, the bodhisattva Vairocanamati, and ten thousand other bodhisattvas rose from their seats together, removed their robes from one shoulder, knelt on their right knees, bowed with their hands placed together, and, facing southeast and looking in that direction with great joy and delight, said these words: “Tathāgata Arhat Samyaksam­buddha Padmottara, you attained complete buddhahood and soon after manifested great miraculous powers, caused the good karma of many hundreds of thousands of millions of trillions of beings to ripen, and established them in irreversible progress toward the highest, most complete enlightenment.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: That is a marvel!

source: །བཅོམ་ལྡན་འདས་གང་གི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་དང་།
en: We pay homage to you!

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཐོང་བ་དོན་ཡོད་དང་།
en: We pay homage to you!”

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆུ་ལྷ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེང་གེའི་བློ་གྲོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པར་སྣང་བྱེད་བློ་གྲོས་དང་། དེ་དག་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་ཁྲིས་བཅོམ་ལྡན་འདས་ཀྱི་ཆོས་བསྟན་པ་བཅད་ནས་ལྷན་ཅིག་ཏུ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་ཤར་ལྷོའི་ཕྱོགས་ལོགས་སུ་མངོན་པར་ཕྱོགས་ཏེ་རབ་ཏུ་དགའ་ཞིང་རབ་ཏུ་དང་བའི་ཡིད་ཀྱིས་བལྟས་ནས་ཚིག་འདི་སྐད་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མ་དམ་པ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས།
en: Then the bodhisattva Ratnavairocana rose from his seat, removed his robe from one shoulder, knelt on his right knee, placed his hands together, bowed in the direction of the Bhagavat, and inquired of the Bhagavat, “Bhagavat, why did the bodhisattva mahāsattva Maitreya, the bodhisattva Amoghadarśin, the bodhisattva Varuṇa, the bodhisattva Siṃhamati, the bodhisattva Vairocanamati, and ten thousand other bodhisattvas rise from their seats together, remove their robes from one shoulder, kneel on their right knees, bow with their hands placed together, and, facing southeast and looking in that direction with great joy and delight, say these words: ‘Tathāgata Arhat Samyaksam­buddha Padmottara, you attained complete buddhahood and soon after manifested great miraculous powers, caused the good karma of many hundreds of thousands of millions of trillions of beings to ripen, and established them in irreversible progress toward the highest, most complete enlightenment.

source: རིང་པོ་མ་ལོན་པར་ཆོ་འཕྲུལ་ཆེན་པོ་དག་བསྟན་ནས།
en: That is a marvel! We pay homage to you!

source: སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དགེ་བའི་རྩ་བ་དག་ལ་ཡོངས་སུ་སྨིན་པར་མཛད་པ་ནི་ངོ་མཚར་ཏེ་ཕྱག་འཚལ་ལོ་ཕྱག་འཚལ་ལོ་ཞེས་མཆི།
en: We pay homage to you!’? “

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མ་དམ་པ་ཤུལ་ནི་ཇི་སྲིད་ཅིག་ན་བཞུགས།
en: How long was the tathāgata arhat samyaksam­buddha Padmottara on the path?

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ནི་ཡུན་ཇི་སྲིད་ཅིག་ལགས།
en: How long has it been since he attained the highest, most complete enlightenment, becoming a complete buddha?

source: གང་ན་དེ་བཞིན་གཤེགས་པ་པད་མ་དམ་པ་ཞེས་བགྱི་བ་བཞུགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་དེའི་མིང་ཅི་ཞེས་བགྱི།
en: What is the name of the realm in which the Tathāgata Padmottara resides?

source: འཇིག་རྟེན་གྱི་ཁམས་དེའི་བཀོད་པ་ནི་ཇི་ལྟ་བུ་ཞིག་གིས་བརྒྱན་པ་ལགས།
en: In what way is that realm adorned by an array of qualities?

source: ཅིའི་སླད་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མ་དམ་པས་ཆོ་འཕྲུལ་ཆེན་པོ་རྣམ་པ་དེ་ལྟ་བུ་དག་བསྟན་པ་མཛད།
en: For what reason did the tathāgata arhat samyaksam­buddha Padmottara perform that kind of great miracle?

source: རྐྱེན་གང་གིས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཁ་ཅིག་གིས་ནི་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་གཞན་དག་ན་བཞུགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མཐོང་ཞིང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་ཆོ་འཕྲུལ་གང་དག་རྣམ་པར་བསྟན་པ་དེ་དག་ཀྱང་མཐོང་ལ་བདག་ཅག་གིས་མི་མཐོང་བར་འགྱུར་ལགས། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: What is the reason why some bodhisattvas can see the bhagavat buddhas who reside in other innumerable realms in the ten directions, and can see the miracles of those buddha bhagavats, while we cannot see them?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེ་རྣམ་པར་སྣང་བྱེད་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་ལེགས་སོ་ལེགས་སོ།
en: The bodhisattva Ratnavairocana said those words, and then the Bhagavat addressed him in return: “Noble son, excellent!

source: །རིགས་ཀྱི་བུ་ཁྱོད་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་དོན་དུ་དེ་བཞིན་གཤེགས་པ་པད་མ་དམ་པས་བྱང་ཆུབ་ཐོབ་པའི་ཆོ་འཕྲུལ་རྣམ་པར་བསྟན་པར་བྱ་བ་དང་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཡོངས་སུ་དྲི་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་དོན་དེ་ལྟ་བུ་ཡོངས་སུ་ཞུ་བར་སེམས་པ་ནི་ཁྱོད་ཀྱི་སྤོབས་པ་དགེ་བ་ཡིན་ཏེ་ཁྱོད་ཀྱིས་ཡོངས་སུ་ཞུས་པ་ལེགས་པ་ཡིན་ནོ།
en: Excellent! Noble son, it is excellent that you have made this request. In order to ripen the good karma of many hundreds of thousands of millions of trillions of beings, you have asked about the Tathāgata Padmottara’s manifestation of the miracle of attaining enlightenment and the qualities of his buddha realm. You have asked this because of the virtue of your confidence.

source: །རིགས་ཀྱི་བུ་དེའི་ཕྱིར་ཁྱོད་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་བཤད་པར་བྱའོ།
en: Noble son, listen carefully and pay attention, for I will explain it to you.” “

source: །བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེ་རྣམ་པར་སྣང་བྱེད་ཀྱིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་ནོ་ཞེས་གསོལ་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་།
en: Bhagavat, I will do so,” said the bodhisattva Ratnavairocana.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེ་རྣམ་པར་སྣང་བྱེད་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: As he listened to the Bhagavat, the Bhagavat recounted to the bodhisattva Ratnavairocana the following description. “

source: །རིགས་ཀྱི་བུ་འདི་ནས་ཤར་ལྷོའི་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་འདས་པ་ན། འཇིག་རྟེན་གྱི་ཁམས་པད་མ་ཞེས་བྱ་བ་ཡོན་ཏན་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ། མེ་ཏོག་སྣ་ཚོགས་བཀྲམ་པ། སྤོས་སྣ་ཚོགས་ཀྱིས་ཁྱབ་པ། རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་དག་གིས་བརྒྱན་པ།
en: Noble son, in the southeast, beyond buddha realms as numerous as the grains of sand in a hundred thousand million trillion Ganges Rivers, there is a realm by the name of Padmā, which is adorned with a variety of good qualities, scattered with a variety of flowers, pervaded by a variety of fragrances, adorned with precious trees, and filled with precious lotuses.

source: རིན་པོ་ཆེའི་པད་མ་དག་གིས་ཀུན་ཏུ་གང་བ་ཞིག་ཡོད་དེ། དེ་ནས་གཞི་ནི་བཻ་དཱུརྱ་སྔོན་པོ་ལས་གྲུབ་ཅིང་།
en: Its ground is made of blue beryl.

source: བྱང་ཆུབ་སེམས་དཔའ་དག་གིས་ཀུན་ཏུ་གང་ལ་ཆོས་ཀྱི་སྒྲས་ཁྱབ་པ་ཡིན་ནོ།
en: It is filled with bodhisattvas and pervaded by the sound of the Dharma.

source: །བཻ་དཱུརྱ་ལས་གྲུབ་པའི་ས་གཞི་དེ་ཡང་ཀ་ཙ་ལིན་དི་ཀ་ལྟར་རེག་ན་བདེ་ཞིང་འཇམ་ལ།
en: The ground made of beryl is as soft and pleasant to the touch as down.

source: རྐང་པ་བཞག་ན་ནི་སོར་བཞི་ཙམ་ནེམས་ཞེས་བྱེད།
en: A foot stepping on it sinks to the depth of four finger-widths, and when the foot is raised, the ground rises back up four finger-widths.

source: རྐང་པ་བཏེག་ན་ནི་སོར་བཞི་ཙམ་པར་ཅེས་བྱེད་ཅིང་པད་མ་སྣ་ཚོགས་དག་གིས་ཀུན་ཏུ་གང་བ་ཡིན་ནོ།
en: Varieties of lotuses cover the ground. “

source: །དེ་ན་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཤིང་ལྗོན་པ་འཕང་དུ་དཔག་ཚད་བདུན་གྱི་སྲིད་ཙམ་པ་དག་ཡོད་དེ།
en: The trees there are made of the seven jewels and are seven yojanas in height.

source: ཤིང་ལྗོན་པ་དེ་དག་ལ་ལྷའི་གོས་ངུར་སྨྲིག་དག་རབ་ཏུ་འཕྱང་ཞིང་། ལྷའི་སིལ་སྙན་ཡིད་དུ་འོང་བའི་སྒྲ་ཡང་དག་པར་འབྱིན་པ་དག་ཀྱང་ཡོད་དོ།
en: They are hung with divine orange cloth, and they emit beautiful, divine music.

source: །ཤིང་ལྗོན་པ་དེ་དག་ལ་བྱ་སྣ་ཚོགས་དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་སྒྲ་ཡིད་དུ་འོང་བ་རབ་ཏུ་སྒྲོགས་པ་དག་ཀྱང་ཡོད་དོ།
en: On those trees there are a variety of birds that sing the beautiful words of the powers, strengths, and factors of enlightenment.

source: །ཤིང་ལྗོན་པ་དེ་དག་གི་ལོ་མ་དག་ཕན་ཚུན་ཕྲད་པ་ན་ལྷའི་ལས་ཤིན་ཏུ་འདས་པའི་སིལ་སྙན་ཡན་ལག་ལྔ་དང་ལྡན་པ་དག་གི་སྒྲ་ཡང་འབྱུང་ངོ་།
en: When the leaves of those trees touch each other, they create music of the five tempos, which surpasses that of the deva realms.

source: །ཤིང་ལྗོན་པ་རེ་རེའི་དྲི་རྒྱ་ཆེན་པོ་ལྷའི་ལས་འདས་པས་ཀྱང་དཔག་ཚད་འབུམ་དུ་ཁྱབ་པར་བྱེད་ཅིང་ཤིང་ལྗོན་པ་དེ་དག་ལ་ལྷའི་རྒྱན་དག་ཀྱང་མངོན་པར་རབ་ཏུ་འཕྱང་ངོ་།
en: Each of those trees has a pervasive fragrance, which surpasses that of the deva realms and spreads over a hundred thousand yojanas, and each of those trees is hung with divine adornments. “

source: །ཤིང་ལྗོན་པ་དེ་དག་གི་བར་དག་ན་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཁང་པ་བརྩེགས་པ་འཕང་དུ་ནི་དཔག་ཚད་ལྔ་བརྒྱ་རྒྱར་ནི་དཔག་ཚད་བརྒྱ་པ་དག་ཡོད་དེ།
en: In between those trees are kūṭāgāras made of the seven jewels, which are each five hundred yojanas high and a hundred yojanas wide.

source: ཁང་པ་བརྩེགས་པ་དེ་དག་ཀུན་ལ་ཡང་ཕྱོགས་བཞི་ན་རྟ་བབས་དག་ཡོད་དོ།
en: Around all these kūṭāgāras, in each of the four directions, there is an ornamental arch.

source: །རྟ་བབས་དེ་དག་གི་ནང་རོལ་ཁང་པ་བརྩེགས་པ་དེ་དག་གི་ཕྱི་རོལ་ན་རྫིང་བུ་སྲིད་དུ་ནི་དཔག་ཚད་བརྒྱད་ཅུ་རྒྱར་ནི་དཔག་ཚད་ལྔ་བཅུ་པ་དག་ཡོད་དོ།
en: Between these ornamental arches and the kūṭāgāras, there are pools that are eighty-eight yojanas long and fifty yojanas wide.

source: །རྫིང་བུ་དེ་དག་གི་ཕྱོགས་བཞི་ཁོ་ར་ཁོར་ཡུག་ན་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའི་ཐེམ་སྐས་དག་ཀྱང་ཡོད་དོ།
en: On the four sides of those pools there are steps made of the seven jewels.

source: །རྫིང་བུ་དེ་དག་ཀྱང་ཁོ་ར་ཁོར་ཡུག་ཏུ་མེ་ཏོག་ཨུད་པ་ལ་དང་། པད་མ་དག་གིས་ཀུན་ནས་ཡོག་སྟེ།
en: Those ponds are covered with blue lotuses and red lotuses.

source: མེ་ཏོག་རེ་རེ་ལ་ཡང་རྒྱར་ནི་དཔག་ཚད་ཙམ་ཡོད་དོ།
en: Each flower is one yojana across.

source: །མེ་ཏོག་དེ་དག་གི་ཟེ་བ་དག་ལས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་རབ་ཏུ་སྐྱེས་ཏེ།
en: Bodhisattva mahāsattvas are born from the pericarps of those flowers.

source: དེ་དག་ཀྱང་ནམ་གྱི་གུང་ཐུན་དང་པོ་ལ་པད་མ་དེ་དག་གི་ཟེ་བ་དག་ལས་སྐྱེ་ཞིང་རྣམ་པར་གྲོལ་བའི་དགའ་བ་དང་།
en: They appear on the pericarps of those lotuses in the first watch of the night.

source: བདེ་བ་མྱོང་བཞིན་དུ་སྐྱིལ་མོ་ཀྲུང་གིས་མཚན་མོ་དེ་འདའ་བར་བྱེད་དེ།
en: They spend the night sitting cross-legged, experiencing the joy and bliss of liberation.

source: དེ་ན་མཚན་མོ་དེའི་ནང་པར་གྱི་དུས་ཀྱི་ཚེ་ཕྱོགས་བཞི་ནས་དྲི་ཞིམ་ཞིང་ཡིད་དུ་འོང་ལ་འཇམ་ཞིང་རེག་ན་བདེ་བར་བྱེད་པའི་རླུང་དག་རབ་ཏུ་ལྡང་སྟེ། དེ་དག་གིས་མེ་ཏོག་ཁ་ཟུམས་པ་རྣམས་མངོན་པར་འབྱེད་པར་བྱེད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཀྱང་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ཏེ།
en: When the night turns to dawn, there come cool, fragrant, gentle breezes, the touch of which is delightful, and which cause the closed flowers to open and the bodhisattvas to emerge from their meditation.

source: རྣམ་པར་གྲོལ་བའི་དགའ་བ་དང་བདེ་བ་སྤངས་ནས་པད་མའི་ཟེ་བ་དག་ལས་བབས་ཏེ། ཁང་པ་བརྩེགས་པ་དེ་དག་ཏུ་ཞུགས་ནས་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་སྟན་དག་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འདུག་ཅིང་ཆོས་ཉན་པར་བྱེད་དོ།
en: Leaving behind the joy and bliss of liberation, they come down from the pericarps and enter the kūṭāgāras, where they sit cross-legged on seats made of the seven jewels and listen to the Dharma. “

source: །ཤིང་ལྗོན་པ་དེ་དག་དང་ཁང་པ་བརྩེགས་པ་དེ་དག་གི་ཕྱོགས་བཞི་ཁོ་ར་ཁོར་ཡུག་དག་ན་རིན་པོ་ཆེ་འཛམ་བུ་ཆུ་བོའི་གསེར་གྱི་རི་འཕང་དུ་ནི་དཔག་ཚད་ཉི་ཤུ་རྒྱར་ནི་དཔག་ཚད་གསུམ་པ་དག་ཡོད་དེ།
en: Surrounding the trees and kūṭāgāras are mountains made of Jambu River gold. They are each twenty yojanas high and three yojanas wide.

source: རི་དེ་དག་གི་བར་བར་དག་ན་ཆུ་ཤེལ་དང་། མེ་ཤེལ་དང་། ཨན་ད་རྙིལ་དང་། ནོར་བུ་སྐར་མདོག་འབུམ་ཕྲག་དུ་མ་དག་སྣང་ངོ་།
en: Between those mountains, many hundreds of thousands of moonstones, sunstones, sapphires, and jyotīrasas are visible.

source: །དེ་ན་སངས་རྒྱས་པད་མ་དམ་པའི་འོད་ཀྱིས་རི་དང་ནོར་བུ་དག་ལ་ཕོག་པ་ན་སངས་རྒྱས་ཀྱི་འོད་དེ་དང་། ནོར་བུའི་འོད་དེས་འཇིག་རྟེན་གྱི་ཁམས་པད་མ་དེ་རྟག་ཏུ་སྣང་བ་རྒྱ་ཆེན་པོས་ཁྱབ་པར་བྱས་ཏེ།
en: When the light of the Buddha Padmottara strikes the mountains and jewels, the light of that buddha and the light of the jewels becomes a continuous great radiance throughout the Padmā realm.

source: དེ་ན་ཉི་མ་དང་ཟླ་བ་དག་གི་འོད་ཀྱང་མི་མངོན་ཏེ་གཞན་དུ་ན་གང་གི་ཚེ་པད་མ་རྣམས་ཁ་ཟུམས་ཤིང་བྱ་དག་སྒྲ་ཆུང་བར་གྱུར་པ་དེའི་ཚེ་ནི་མཚན་མོ་ཞེས་བྱ་བའི་གྲངས་སུ་འགྱུར་ལ་དེ་ལས་བཟློག་པ་ནི་ཉིན་པར་ཡིན་ནོ།
en: The light of a sun or moon is unknown, but when the lotuses close and the birdsong diminishes, that is called night, and the opposite is day. “

source: །རི་དེ་དག་གི་སྟེང་ན་བཻ་དཱུརྱ་སྔོན་པོ་ལས་བྱས་པའི་ཁང་པ་བརྩེགས་པ་འཕང་དུ་ནི་དཔག་ཚད་དྲུག་ཅུ་རྒྱར་ནི་དཔག་ཚད་ཉི་ཤུ་པ་དག་ཡོད་དེ།
en: On top of the mountains are kūṭāgāras of blue beryl, which are sixty yojanas high and twenty yojanas wide.

source: ཁང་པ་བརྩེགས་པ་དེ་དག་གི་ཕྱོགས་བཞི་ན་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའི་རྟ་བབས་དག་ཀྱང་ཡོད་དོ།
en: In each of the four directions from the kūṭāgāras there are ornamental archways made of the seven jewels.

source: །ཁང་པ་བརྩེགས་པ་དེ་དག་ན་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའི་ཁྲི་དག་ཡོད་དེ་དེ་ལ་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དག་འདུག་ཅིང་ཆོས་ཉན་པར་བྱེད་དོ།
en: Within the kūṭāgāras, there are thrones made of the seven jewels, upon which bodhisattvas in their last lifetime sit and listen to the Dharma. “

source: །རིགས་ཀྱི་བུ་འཇིག་རྟེན་གྱི་ཁམས་པད་མ་དེ་ན་བྱང་ཆུབ་ཀྱི་ཤིང་དབང་པོ་ཞེས་བྱ་བ་འཕང་དུ་ནི་དཔག་ཚད་སུམ་སྟོང་རྒྱར་ནི་དཔག་ཚད་ལྔ་བརྒྱ།
en: Noble son, in the Padmā realm there is the excellent presence of a Bodhi tree called Indra, which is three thousand yojanas high with a trunk five hundred yojanas wide.

source: ཡལ་ག་དང་། ལོ་མ་དང་། འདབ་མ་དག་ནི་དཔག་ཚད་སྟོང་དུ་ལེགས་པར་གནས་པ་ཡོད་དོ།
en: Its branches, leaves, and petals are a thousand yojanas wide. “

source: །བྱང་ཆུབ་ཀྱི་ཤིང་དེའི་དྲུང་ན་དངུལ་ལས་བྱས་པའི་པད་མ་སྡོང་བུའི་འཕང་དུ་ནི་དཔག་ཚད་ལྔ་བརྒྱ་ཡོད་ལ།
en: At the foot of this Bodhi tree there is a silver lotus stalk, which is five hundred yojanas high.

source: དེའི་འདབ་མ་ནི་གསེར་ལས་བྱས་པ་བྱེ་བ་ཕྲག་འབུམ་ཡོད་དེ་འཕང་དུ་ནི་དཔག་ཚད་ལྔ་ཡོད་དོ།
en: It has a hundred thousand million gold petals, five yojanas in height.

source: །ཟེ་བ་ཐམས་ཅད་ན་རིན་པོ་ཆེ་རྡོའི་སྙིང་པོ་ལས་བྱས་པའི་ཟེའུ་འབྲུ་དག་ཡོད་དོ། །ཟེ་བ་རྣམས་ནི་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པ་སྟེ། འཕང་དུ་ནི་དཔག་ཚད་བཅུ་རྒྱར་ནི་དཔག་ཚད་བདུན་ཡོད་དོ།
en: All the pericarps have emerald stamens, and the pericarps, which are made of the seven jewels, are ten yojanas high and seven yojanas wide.

source: །དེར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མ་དམ་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: It is upon this that the tathāgata arhat samyaksam­buddha Padmottara attained the highest, most complete enlightenment, becoming a complete buddha. “

source: །སངས་རྒྱས་ཀྱི་གདན་པད་མ་དེའི་ཁོ་ར་ཁོར་ཡུག་ན་ཡང་པད་མ་དག་ཡོད་དེ། དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་དག་འཁོད་པས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མ་དམ་པའི་ཆོ་འཕྲུལ་དག་མཐོང་བར་གྱུར་ཏོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: Encircling that buddha’s lotus seat are other lotuses, upon which sit bodhisattvas who see the miracles of the tathāgata arhat samyaksam­buddha Padmottara.”

source: བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེ་རྣམ་པར་སྣང་བྱེད་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མ་དམ་པས་ཆོ་འཕྲུལ་ཆེན་པོ་ཇི་ལྟ་བུ་དག་བསྟན་པ་མཛད་པ་ལགས། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: The bodhisattva Ratnavairocana then asked the Bhagavat, “Bhagavat, what kind of miracles did the tathāgata arhat samyaksam­buddha Padmottara manifest?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེ་རྣམ་པར་སྣང་བྱེད་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མ་དམ་པ་ནི་མདང་གི་ནམ་གྱི་ཐུན་ཐ་མ་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས།
en: The Bhagavat replied to the bodhisattva Ratnavairocana, “Noble son, in the last watch of the night, the tathāgata arhat samyaksam­buddha Padmottara attained the highest, most complete enlightenment, becoming a complete buddha, and at dawn he performed a miracle.

source: ད་ནང་ནང་པར་གྱི་དུས་ཀྱི་ཚེ་འདི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་མཛད་དེ་བདག་ཉིད་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་མངོན་པར་སྤྲུལ་ནས་དབུའི་གཙུག་ཏོར་ནས་འོད་ཟེར་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་རབ་ཏུ་བཀྱེའོ།
en: He transformed himself to the height of the Brahmā realm and his uṣṇīṣa radiated a hundred thousand million trillion light rays.

source: །འོད་ཟེར་དེ་དག་གིས་སྟེང་གི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་སྣང་བས་ཁྱབ་པར་མཛད་དོ།
en: Those light rays illuminated the upper region’s realms, which are as numerous as the particles in a buddha realm.

source: །དེའི་ཚེ་སྟེང་གི་ཕྱོགས་ན་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་གནས་པ་དག་གིས་ཐུར་དུ་བལྟས་ན་དེ་དག་ལ་རི་རབ་དང་། ཁོར་ཡུག་དང་།
en: At that time, the bodhisattvas who dwelt in the upper regions looked downward.

source: ཁོར་ཡུག་ཆེན་པོ་དང་། རི་ནག་པོ་རྣམས་ཀྱང་སྣང་བར་མ་གྱུར་ཏོ། །འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་ལུང་བསྟན་པ་དག་དང་། གང་དག་ཏིང་ངེ་འཛིན་ཐོབ་པ་དག་དང་། གང་དག་གཟུངས་ཐོབ་པ་དག་དང་།
en: They did not perceive Sumeru or the Cakravāḍa, Mahācakravāḍa, or Kāla mountain ranges.

source: གང་དག་བཟོད་པ་ཐོབ་པ་དག་དང་། གང་དག་ས་ལས་ཤིན་ཏུ་འདས་པ་དག་དང་། དེ་ན་གང་དག་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཀྱང་སྣང་བ་དེ་ཁྱབ་པར་གྱུར་ནས་ཐལ་མོ་སྦྱར་ཏེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མ་དམ་པ་དེའི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུས་ལེགས་པར་བརྒྱན་པའི་སྐུ་ཡང་མཐོང་།
en: In those worlds, the bodhisattvas who had received prophecy, who had attained samādhi, who had attained retention, who had attained acceptance, and who had completely transcended the levels of the śrāvakas and pratyekabuddhas, and those bodhisattva mahāsattvas who were in their final lifetime, were illuminated, placed their palms together in reverence, and saw the tathāgata arhat samyaksam­buddha Padmottara’s body, which was perfectly adorned by the thirty-two signs and eighty excellent features of a great being. “

source: བྱང་ཆུབ་སེམས་དཔའ་འཁོར་དེ་དང་། འཇིག་རྟེན་གྱི་ཁམས་པད་མའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཡང་མཐོང་ངོ་།
en: They also saw the assembly of bodhisattvas and the array of good qualities of that buddha realm, the world known as Padmā.
